test/load/ums-api-http.yaml
config:
  # target: "https://143.198.5.34"
  # tls:
  #   rejectUnauthorized: false
  target: "https://api.universalmediaserver.com"
  http:
    extendedMetrics: true
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 120
      arrivalRate: 10
      rampTo: 25
      name: 'Ramp up'
    - duration: 1200
      arrivalRate: 25
      name: 'Cruise'
    - duration: 30
      arrivalRate: 100
      name: 'Crash'
  payload:
    path: "movies.csv"
    fields:
      - "title"
    order: sequence
    skipHeader: true
scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/api/media/video?title={{title}}"
    - get:
        url: "/api/media/season?title={{title}}&season=1"