test/load/ums-api-http.yaml
config:
  target: "https://api.universalmediaserver.com"
  http:
    extendedMetrics: true
  phases:
    - duration: 120
      arrivalRate: 10
      rampTo: 50
  payload:
    path: "movies.csv"
    fields:
      - "title"
    order: sequence
    skipHeader: true
scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/api/media/video?title={{title}}"